use subscribersTelephoneCompany;

create table Абоненты(Номер int identity(1,1) primary key, ФИО varchar(200), ДатаРождения date, НомерТелефона varchar(50), АдресПроживания varchar(200))
insert into Абоненты values
('Максимова Анастасия Петровна', '08.10.2005', '89964438612', 'г. Владимир, ул. Добросельская, сад Коммунальник уч. 28'),
('Муравьев Артем Александрович', '09.02.2005', '89308325199', 'г. Владимир, ул. Новинки дом 16'),
('Гаврилова Варвара Кирилловна', '01.06.2005', '89300328940', 'г. Владимир, ул. НеБумБумКакая'),
('Кулев Алексей Антонович', '01.07.2005', '89004796226', 'г. Владимир, ул. 3-кв');

create table ИнформацияАбонентов (Номер int identity(1,1) primary key, Баланс int, Тариф int foreign key references Тарифы(Номер), Услуги varchar(200))
insert into ИнформацияАбонентов values
('1000', 1, '1 3 5'),
('1000', 1, '2 1'),
('932', 2, '1'),
('633', 3, '3 4');

create table Операции (Номер int identity(1,1) primary key, НомерАбонента int foreign key references Абоненты(Номер), Дата date, Сумма varchar(100))
insert into Операции values
(1, '01.11.2023', '+300'),
(1, '11.10.2023', '-200'),
(1, '09.09.2023', '+200'),
(2, '04.12.2023', '-300'),
(2, '03.11.2023', '+200'),
(3, '23.08.2023', '+1000'),
(4, '01.12.2023', '-234'),
(4, '16.10.2023', '+234');

create table Услуги (Номер int identity(1,1) primary key, Наименование varchar(200), Стоимость int, Оплата varchar(50), ИнформацияОбУслуге varchar(200))
insert into Услуги values
('БезлимитТГ', '10', 'раз в сутки', 'бла бла бла'),
('БезлимитТТ', '10', 'раз в сутки', 'бла бла бла'),
('БезлимитЮтуб', '10', 'раз в сутки', 'бла бла бла'),
('ОповещенияОбОплате', '80', 'раз в месяц', 'бла бла бла'),
('ВеселыйЗвонокНаГудок', '129', 'раз в месяц', 'бла бла бла');

create table Тарифы (Номер int identity(1,1) primary key, Наименование varchar(100), Стоимость int, КоличествоМинут int, КоличествоСМС int, Интернет varchar(50))
insert into Тарифы values
('BlackOnline+', '400', '200', '20', '50 ГБ'),
('Online+', '300', '100', '20', '50 ГБ'),
('Online', '200', '50', '10', 'безлимит');

create table Договора (Номер int identity(1,1) primary key, ДатаЗаключения date, МестоЗаключения varchar(200), КодовоеСлово varchar(50), Тариф int foreign key references Тарифы(Номер))
insert into Договора values
('02.02.2021', 'г. Владимир', 'Журналист', 1),
('02.02.2021', 'г. Владимир', 'Сложно', 1),
('02.05.2021', 'г. Владимир', 'Песоооочек', 2),
('02.03.2021', 'г. Владимир', 'Бомж', 3);

alter table Абоненты add foreign key (Номер) references Договора(Номер)
alter table Абоненты add foreign key (Номер) references ИнформацияАбонентов(Номер)

drop table ИнформацияАбонентов
drop table Тарифы
drop table Услуги
drop table Операции
drop table Договора
drop table Абоненты
